Using mermaid
